src/main/java/com/amdocs/halo/automation/xmls/VNF_standAlone.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cus="http://CustomerOrderEstablishment.ocxGenericServices.services.amdocs.com">
   <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-1">
            <wsse:Username>OMS</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Oms111</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <cus:createProductOrderForNewProduct>
         <createProductOrderForNewProductRequest>
            <salesChannel>SA</salesChannel>
            <options>
               <confirmationChecksApproved>true</confirmationChecksApproved>
            </options>
            <order>
               <attUserId>gp1650</attUserId>
               <customer>
                  <contractId>TEST_OMX_CONTRACT</contractId>
                  <customerName>Outsourcing Std. Test Company</customerName>
                  <saartId>SAART0032091</saartId>
                  <!--To trigger billing activity, comment below tag-->
                  <!--<customContractType>NO BILL-SHELL</customContractType>-->
                  <customerId>917127322</customerId>
               </customer>
               <description>UCPE NEW API</description>
               <productOfferings>
                  <!--vrtr-->
                  <productOfferingId>5735285</productOfferingId>
                  <!--standalone VNF-->
                  <topLevelProducts>
                     <associationSpec>
                        <productSpecsId>5637585</productSpecsId>
                        <!--catalogProductCode vnf-->
                     </associationSpec>
                     <orderItem>
                        <contacts>
                           <contactType>CUS</contactType>
                           <email>abx@amdocs.com</email>
                           <firstName>AlbertCus</firstName>
                           <landLinePhone>2141113435</landLinePhone>
                           <lastName>lior</lastName>
                           <mobilePhone>2143334444</mobilePhone>
                           <streetAddress1>79 STOCKTON AVE floor 38</streetAddress1>
                           <streetAddress2>room 3801</streetAddress2>
                           <city>San JOSE</city>
                           <state>CA</state>
                           <stateName>California</stateName>
                           <zipCode>95136</zipCode>
                           <country>United States</country>
                           <isoCountryCode>US</isoCountryCode>
                        </contacts>
                        <externalId>123438911</externalId>
                        <orderActionType>PR</orderActionType>
                        <!--<reason>
                           <reasonText>Customer Request</reasonText>
                           <reasonType>CREQ</reasonType>
                        </reason>-->
                        <reason>
                           <reasonText>reasonCode</reasonText>
                           <reasonType>LICUPG</reasonType>
                        </reason>
                        <serviceAdddress>
                           <siteAlias>JKsiteAlias38911</siteAlias>
                           <houseNumber>1234</houseNumber>
                           <directionalPrefix/>
                           <streetName>Service_Location_Address1_streetName_VRTR</streetName>
                           <streetAddress2>Service_Location_Address2_streetAddress2_VRTR</streetAddress2>
                           <streetAddress3>Service_Location_Address3_streetAddress3_VRTR</streetAddress3>
                           <city>Richardson</city>
                           <state>TX</state>
                           <stateName>Texas</stateName>
                           <zipCode>75081</zipCode>
                           <clli8>SNJPCAWM</clli8>
                           <emtCLLI/>
                           <floor>4</floor>
                           <country>US</country>
                           <isoCountryCode>US</isoCountryCode>
                        </serviceAdddress>
                        <serviceRequiredDate>2022-10-25T23:59:59+02:00</serviceRequiredDate>
                     </orderItem>
                     <topLevelProduct>
                        <containedProducts>
                           <action>CHANGE</action>
                           <associationSpecDefinition>
                              <componentServiceType>VNF</componentServiceType>
                           </associationSpecDefinition>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeId>8959</attributeId>
                                 <!--8959,TotalRC,AbsString-->
                              </characteristicDefinition>
                              <value>3</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeId>5578615</attributeId>
                                 <!--5578615,model,AbsString-->
                              </characteristicDefinition>
                              <value>vrtrmodel38911</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeId>5582395</attributeId>
                                 <!--5582395,vendor,DynVendorVNF_all-->
                              </characteristicDefinition>
                              <value>CISCO</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeId>5606325</attributeId>
                                 <!--5606325,versionNumber,AbsString-->
                              </characteristicDefinition>
                              <value>vrtrvno38911</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeId>8969</attributeId>
                                 <!--8969,TotalOC,AbsString-->
                              </characteristicDefinition>
                              <value>31.2</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeId>5637865</attributeId>
                                 <!--5637865,vnfType,DynVNFType_all-->
                              </characteristicDefinition>
                              <value>VRTR</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeId>5589155</attributeId>
                                 <!--5589155,partNumber,AbsString-->
                              </characteristicDefinition>
                              <value>vrtrpno38911</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeId>71893</attributeId>
                                 <!--71893,managementOption,DynManagementOptionVNF_Gamma-->
                              </characteristicDefinition>
                              <value>ATT</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeId>68283</attributeId>
                                 <!--68283,baseServiceType,DynBaseServiceType-->
                              </characteristicDefinition>
                              <value>uCPE-VMS</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeId>5582385</attributeId>
                                 <!--5582385,hostName,RLC_String-->
                              </characteristicDefinition>
                              <value>PGVRTRHO6SA1</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeId>5331</attributeId>
                                 <!--5331,maintenanceOption,DynMaintenanceOption_VNF_all-->
                              </characteristicDefinition>
                              <value>24x7x4</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeId>5621845</attributeId>
                                 <!--5621845,CURRENCY,AbsString-->
                              </characteristicDefinition>
                              <value>INR</value>
                           </characteristicValues>
                           <installationAddressID>201</installationAddressID>
                        </containedProducts>
                        <containedProducts>
                           <action>CHANGE</action>
                           <associationSpecDefinition>
                              <componentServiceType>RLNK</componentServiceType>
                           </associationSpecDefinition>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeId>5582485</attributeId>
                                 <!--5582485,referenceType,DynReferenceTypeVROUTER-->
                              </characteristicDefinition>
                              <value>uCPE</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeId>5582475</attributeId>
                                 <!--5582475,referenceID,RLC_String-->
                              </characteristicDefinition>
                              <value>PGUCPEHO6SA1</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeId>5638075</attributeId>
                                 <!--5638075,referenceAliasHostName,AbsString-->
                              </characteristicDefinition>
                              <value>PGALIASUCPHSA1</value>
                           </characteristicValues>
                           <installationAddressID>201</installationAddressID>
                        </containedProducts>
                     </topLevelProduct>
                  </topLevelProducts>
               </productOfferings>
               <!--vrtr-->
               <startOrderingProcess>true</startOrderingProcess>
            </order>
         </createProductOrderForNewProductRequest>
      </cus:createProductOrderForNewProduct>
   </soapenv:Body>
</soapenv:Envelope>